app/Controllers/Asignaturas.php

SELECT `asignatura`.*, `tipo_asignatura`.`nombre` AS `tipo_asignatura_nombre`
FROM `asignatura`
JOIN `tipo_asignatura` ON `asignatura`.`tipo_asignatura` = `tipo_asignatura`.`id`
WHERE `asignatura`.`activo` = 1
---
    public function index($activo = 1)
    {

        // Realiza un join entre la tabla 'asignatura' y 'atipo_asignatura'
        $asignatura = $this->asignatura->select('asignatura.*, tipo_asignatura.nombre AS tipo_asignatura_nombre')
            ->join('tipo_asignatura', 'asignatura.tipo_asignatura = tipo_asignatura.id')
            ->where('asignatura.activo', $activo)
            ->findAll();