app/Controllers/Escuela.php

    public function nuevo()
    {
        // Obtener las modalidad usando el modelo
        $modalidad = $this->modalidades->findAll();
        $niveles = $this->nivel->findAll();
        $distritoEducativo = $this->distrito_educativo->first();
---
SELECT *
FROM `modalidad`
SELECT *
FROM `distrito_educativo`
 LIMIT 1