app/Controllers/Estudiantes.php

    public function index($activo = 1)
    {
        $estudiantes = $this->estudiantes->where('activo', $activo)->findAll();
---
SELECT *
FROM `estudiantes`
WHERE `activo` = 1