app/Controllers/gradossecciones.php

SELECT *
FROM `schoolyear`
WHERE `estado` = 'En curso'
 LIMIT 1
---
    public function index()
    {
        $id_escuela = session('id_escuela'); // Obtiene el ID de la escuela desde la sesión
        $schoolYear = $this->schoolyear->where('estado', 'En curso')->first();

SELECT *
FROM `escuela`
WHERE `escuela`.`id` = '1'
SELECT *
FROM `secciones`
---
    public function curso_nuevo()
    {
        $id_escuela = session('id_escuela');
        $escuela = $this->escuela->find($id_escuela);

        if (!$escuela) {
            return redirect()->back()->with('error', 'No se encontró la escuela seleccionada.');
        }

        // 1️ Obtener los grados activos asociados al nivel de la escuela
        $grados = $this->gradoniveles->getGradosPorEscuela_activos($id_escuela);

        // 2️ Obtener los servicios activos de la escuela
        $servicios = $this->escuelaservicios->getServiciosPorEscuela_activos($id_escuela);





        // 3️ Preparar los datos para la vista
        $data = [
            'titulo'     => 'Registro de Cursos',
            'grados'     => $grados,
            'secciones'  => $this->secciones->findAll(),

SELECT *
FROM `schoolyear`
WHERE `estado` = 'En curso'
ORDER BY `id` DESC
 LIMIT 1
SELECT `escuelas_servicios`.`id_servicio`, `servicios`.`nombre` AS `nombre_servicio`, `salidas_tecnicas`.`nombre` AS `nombre_salida`
FROM `escuelas_servicios`
JOIN `servicios` ON `servicios`.`id` = `escuelas_servicios`.`id_servicio`
LEFT JOIN `salidas_tecnicas` ON `servicios`.`id` = `salidas_tecnicas`.`id_servicio`
WHERE `escuelas_servicios`.`id_escuela` = '1'
---
    public function configurar_cursos()
    {
        $id_escuela = session('id_escuela'); // ID de la escuela desde la sesión

        // Obtener el año escolar en curso
        $schoolYear = $this->schoolyear
            ->where('estado', 'En curso')
            ->orderBy('id', 'DESC')
            ->first();

        $titulo = 'Configuración de Cursos para el ' . ($schoolYear['nombre'] ?? '(No definido)');

        // Cargar servicios disponibles para la escuela
        $servicios = $this->escuelaservicios
            ->select('
            escuelas_servicios.id_servicio,
            servicios.nombre AS nombre_servicio,
            salidas_tecnicas.nombre AS nombre_salida
        ')
            ->join('servicios', 'servicios.id = escuelas_servicios.id_servicio')
            ->join('salidas_tecnicas', 'servicios.id = salidas_tecnicas.id_servicio', 'left')
            ->where('escuelas_servicios.id_escuela', $id_escuela)
            ->findAll();

SELECT *
FROM `cursos_base`
WHERE `id_servicio` = 1
ORDER BY `nombre_curso` ASC
---
    public function obtenerCursosPorServicio()
    {
        $id_servicio = $this->request->getGet('id_servicio');
        $salida = $this->request->getGet('salida'); // puede ser null o vacío

        if (!$id_servicio) {
            return $this->response->setJSON([]);
        }

        $cursosQuery = $this->cursosBase
            ->where('id_servicio', intval($id_servicio));

        // Filtrar por salida técnica si se proporcionó
        if (!empty($salida)) {
            $cursosQuery->like('nombre_curso', $salida);
        }

        $cursos = $cursosQuery
            ->orderBy('nombre_curso', 'ASC')
            ->findAll();