app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `personal`
INNER JOIN `usuarios` ON `usuarios`.`personal_id` = `personal`.`id`
WHERE `usuarios`.`id_escuela` = '2'
AND `usuarios`.`id_tipo_usuario` = 1
AND `personal`.`activo` = 1
---
            // Personal
            $data['total_personal']       = $this->personal->contarPersonalPorEscuela($idEscuela);
            $data['total_docentes']       = $this->personal->contarDocentesPorEscuela($idEscuela);
            $data['total_administrativos'] = $this->personal
                ->join('usuarios', 'usuarios.personal_id = personal.id', 'inner')
                ->where('usuarios.id_escuela', $idEscuela)
                ->where('usuarios.id_tipo_usuario', 1) // o el ID real de "Administrativo"
                ->where('personal.activo', 1)
                ->countAllResults();