app/Controllers/Inscripciones.php

    public function nuevo()
    {
        $responsables = $this->responsables->findAll();
        $schoolYears = $this->schoolYear->findAll();


        // 🔥 Obtener monto de inscripción y mensualidad
        $conceptoInscripcion = $this->conceptoPagos->where('nombre', 'Inscripción')->first();
        $conceptoMensualidad = $this->conceptoPagos->where('nombre', 'Mensualidad')->first();

        $cantidadMensualidades = 12; // O el número real en tu sistema

        // 🔹 Obtener estudiantes según responsable (opcional para que cargue al inicio)
        $id_responsable = $this->request->getGet('id_responsable') ?? null;

        $estudiantes = [];
        if ($id_responsable) {
            $estudiantes = $this->estudiantes
                ->where('responsables', $id_responsable)
                ->findAll();
        }

        $cursos = $this->distribucionAcademica
            ->select('distribucion_academica.id, cursos.nombreCurso, escuela.codigo_gestion')
            ->join('cursos', 'cursos.id = distribucion_academica.id_curso', 'left')
            ->join('escuela', 'escuela.id = distribucion_academica.id_escuela', 'left')
            ->findAll();
---
SELECT *
FROM `responsables`
SELECT *
FROM `schoolyear`
SELECT *
FROM `concepto_pagos`
WHERE `nombre` = 'Inscripción'
 LIMIT 1
SELECT *
FROM `concepto_pagos`
WHERE `nombre` = 'Mensualidad'
 LIMIT 1
SELECT `distribucion_academica`.`id`, `cursos`.`nombreCurso`, `escuela`.`codigo_gestion`
FROM `distribucion_academica`
LEFT JOIN `cursos` ON `cursos`.`id` = `distribucion_academica`.`id_curso`
LEFT JOIN `escuela` ON `escuela`.`id` = `distribucion_academica`.`id_escuela`

    public function registrar()
    {
        $id_responsable = $this->request->getPost('id_responsable');
        $metodo_pago = $this->request->getPost('metodo_pago');

        // Comentado hasta que se defina su uso (validación o registro)
        // $total_pago = $this->request->getPost('total_pago'); // ➡️ Se puede usar para validar el monto total más adelante

        $inscribir = $this->request->getPost('inscribir');
        $cursos = $this->request->getPost('id_curso');
        $montos = $this->request->getPost('monto');
        $pagoCompleto = $this->request->getPost('pago_completo');
        $id_schoolYear = $this->request->getPost('id_schoolYear');

        if (!$inscribir) {
            return redirect()->back()->with('error', 'Debe seleccionar al menos un estudiante.');
        }

        // 🔹 Traer el monto de mensualidad dinámico desde la BD
        $conceptoMensualidad = $this->conceptoPagos->where('nombre', 'Mensualidad')->first();
---
SELECT *
FROM `concepto_pagos`
WHERE `nombre` = 'Mensualidad'
 LIMIT 1

            }

            // Obtener datos del estudiante para la factura
            $estudiante = $this->estudiantes->find($id_estudiante);
---
SELECT *
FROM `estudiantes`
WHERE `estudiantes`.`id` = '6'