app/Controllers/Pagos.php

SELECT *
FROM `responsables`
SELECT *
FROM `schoolyear`
WHERE `estado` = 'En curso'
 LIMIT 1
SELECT *
FROM `concepto_pagos`
WHERE `nombre` = 'Inscripción'
 LIMIT 1
SELECT *
FROM `concepto_pagos`
WHERE `nombre` = 'Mensualidad'
 LIMIT 1
---
    public function nueva_inscripcion()
    {
        // 🔹 Obtener responsables y año escolar activo
        $responsables = $this->responsables->findAll();
        $schoolYearActivo = $this->schoolYear->where('estado', 'En curso')->first();
        $id_schoolYear = $schoolYearActivo ? $schoolYearActivo['id'] : null;

        // 🔹 Obtener conceptos de pago
        $conceptoInscripcion = $this->conceptoPagos->where('nombre', 'Inscripción')->first();
        $conceptoMensualidad = $this->conceptoPagos->where('nombre', 'Mensualidad')->first();