app/Controllers/Personal.php

    public function index($activo = 1)
    {

        // SELECT * FROM schoolyear WHEN activo = $activo
        $personal = $this->personal->where('activo', $activo)->findAll();
---
SELECT *
FROM `personal`
WHERE `activo` = 1