app/Controllers/Personal.php

SELECT *
FROM `escuela`
WHERE `codigo_gestion` = '15661'
 LIMIT 1
SELECT *
FROM `personal`
WHERE `activo` = 1
AND `id_escuela` = '2'
---
    public function index($activo = 1)
    {
        $session = session();
        $codigoGestion = $session->get('codigo_gestion'); // ← Obtener el código_gestion desde la sesión

        if (!$codigoGestion) {
            return redirect()->to('/login')->with('error', 'No se encontró un código de gestión en la sesión.');
        }

        // Buscar la escuela con ese código_gestion
        $escuela = $this->escuela->where('codigo_gestion', $codigoGestion)->first();

        if (!$escuela) {
            return redirect()->to('/login')->with('error', 'No se encontró una escuela asociada a ese código de gestión.');
        }

        $idEscuela = $escuela['id']; // ID real de la escuela

        // Filtrar por escuela e indicador de activo
        $personal = $this->personal
            ->where('activo', $activo)
            ->where('id_escuela', $idEscuela)
            ->findAll();