app/Controllers/Responsables.php

SELECT *
FROM `responsables`
WHERE `activo` = 1
---
    public function index($activo = 1)
    {
        // SELECT * FROM schoolyear WHEN activo = $activo
        $responsables = $this->responsables->where('activo', $activo)->findAll();