app/Controllers/Usuarios.php

    public function verificarLogin()
    {
        $usuario = $this->request->getPost('usuario');
        $clave = $this->request->getPost('clave');

        // Paso 1: Buscar usuario básico
        $datosUsuario = $this->usuarios->verificarCredenciales($usuario);

        if (!$datosUsuario) {
            return redirect()->to(base_url('login'))->with('error', 'Usuario o contraseña incorrectos');
---
SELECT *
FROM `usuarios`
WHERE `usuario` = 'admin'
 LIMIT 1


        // Paso 4.5: Si es personal, guardar nombre completo
        if (!empty($datosUsuario['personal_id'])) {
            $personal = $this->personal->find($datosUsuario['personal_id']);
---
SELECT *
FROM `personal`
WHERE `personal`.`id` = '5'


        // Paso 5: Datos de escuela
        if (!empty($datosUsuario['id_escuela'])) {
            $escuela = $this->escuela->find($datosUsuario['id_escuela']);
---
SELECT *
FROM `escuela`
WHERE `escuela`.`id` = '2'

        if ($datosUsuario['id_tipo_usuario'] == 5) {
            $foto = base_url('assets/img/users/admin/default-avatar.png');
        } elseif (!empty($datosUsuario['personal_id'])) {
            $personal = $this->personal->find($datosUsuario['personal_id']);
---
SELECT *
FROM `personal`
WHERE `personal`.`id` = '5'

    public function getEscuelas()
    {
        // Verificar si el usuario es administrador
        if (session('tipo_usuario') != '5') {
            return $this->response->setJSON(['status' => 'error', 'message' => 'No autorizado']);
        }

        $escuelas = $this->escuela->findAll();
---
SELECT *
FROM `escuela`