app/Models/CursosBaseModel.php

    public function obtenerCursosBasePorEscuela($id_escuela)
    {
        return $this->select('cursos_base.*, grados.nombre AS grado, secciones.letra AS seccion, escuela.nombre AS escuela')
            ->join('grados_niveles', 'grados_niveles.id = cursos_base.id_grado')
            ->join('grados', 'grados.id = grados_niveles.id_grado') // join a tabla grados
            ->join('secciones', 'secciones.id = cursos_base.id_seccion')
            ->join('escuela', 'escuela.id = cursos_base.id_escuela')
            ->where('cursos_base.id_escuela', $id_escuela)
            ->orderBy('grados_niveles.id_grado', 'ASC')
            ->findAll();
---
SELECT `cursos_base`.*, `grados`.`nombre` AS `grado`, `secciones`.`letra` AS `seccion`, `escuela`.`nombre` AS `escuela`
FROM `cursos_base`
JOIN `grados_niveles` ON `grados_niveles`.`id` = `cursos_base`.`id_grado`
JOIN `grados` ON `grados`.`id` = `grados_niveles`.`id_grado`
JOIN `secciones` ON `secciones`.`id` = `cursos_base`.`id_seccion`
JOIN `escuela` ON `escuela`.`id` = `cursos_base`.`id_escuela`
WHERE `cursos_base`.`id_escuela` = '1'
ORDER BY `grados_niveles`.`id_grado` ASC

    public function contarSeccionesPorEscuela($id_escuela)
    {
        return $this->where('id_escuela', $id_escuela)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `cursos_base`
WHERE `id_escuela` = '1'