app/Models/CursosModel.php

SELECT COUNT(*) AS `numrows`
FROM `cursos`
JOIN `cursos_base` ON `cursos_base`.`id` = `cursos`.`id_cursos_base`
WHERE `cursos`.`id_schoolyear` = '1'
AND `cursos`.`activo` = 1
AND `cursos_base`.`id_escuela` = '1'
---
    public function contarCursosDisponibles($id_escuela, $id_schoolyear)
    {
        return $this->join('cursos_base', 'cursos_base.id = cursos.id_cursos_base')
            ->where('cursos.id_schoolyear', $id_schoolyear)
            ->where('cursos.activo', 1)
            ->where('cursos_base.id_escuela', $id_escuela)
            ->countAllResults();