app/Models/EscuelaModel.php

    public function getEscuelasConDetalles($activo = null)
    {
        $query = $this->select('escuela.*, niveles.nombre AS nivel, modalidad.nombre AS modalidad')
            ->join('niveles', 'niveles.id = escuela.id_nivel', 'left')
            ->join('modalidad', 'modalidad.id = escuela.id_modalidad', 'left');

        if (!is_null($activo)) {
            $query->where('escuela.activo', $activo);
        }

        return $query->findAll();
---
SELECT `escuela`.*, `niveles`.`nombre` AS `nivel`, `modalidad`.`nombre` AS `modalidad`
FROM `escuela`
LEFT JOIN `niveles` ON `niveles`.`id` = `escuela`.`id_nivel`
LEFT JOIN `modalidad` ON `modalidad`.`id` = `escuela`.`id_modalidad`
WHERE `escuela`.`activo` = 1

    public function getNivelNombreByEscuela($idEscuela)
    {
        $escuela = $this->select('niveles.nombre AS nivel')
            ->join('niveles', 'niveles.id = escuela.id_nivel')
            ->where('escuela.id', $idEscuela)
            ->first();
---
SELECT `niveles`.`nombre` AS `nivel`
FROM `escuela`
JOIN `niveles` ON `niveles`.`id` = `escuela`.`id_nivel`
WHERE `escuela`.`id` = '1'
 LIMIT 1