app/Models/EscuelaServiciosModel.php

SELECT `servicios`.`id`, `servicios`.`nombre` AS `servicio_nombre`, `salidas_tecnicas`.`nombre` AS `salida_tecnica`
FROM `escuelas_servicios`
JOIN `servicios` ON `servicios`.`id` = `escuelas_servicios`.`id_servicio`
LEFT JOIN `salidas_tecnicas` ON `salidas_tecnicas`.`id_servicio` = `servicios`.`id`
WHERE `escuelas_servicios`.`id_escuela` = '1'
AND `escuelas_servicios`.`activo` = 1
---
    public function getServiciosPorEscuela_activos($id_escuela)
    {
        return $this->select('
            servicios.id,
            servicios.nombre AS servicio_nombre,
            salidas_tecnicas.nombre AS salida_tecnica')
            ->join('servicios', 'servicios.id = escuelas_servicios.id_servicio')
            ->join('salidas_tecnicas', 'salidas_tecnicas.id_servicio = servicios.id', 'left')
            ->where('escuelas_servicios.id_escuela', $id_escuela)
            ->where('escuelas_servicios.activo', 1)
            ->findAll();