app/Models/GradosNivelesModel.php

SELECT *
FROM `escuela`
WHERE `escuela`.`id` = '1'
SELECT `grados_niveles`.*, `grados`.`nombre` as `nombre_grado`, `grados`.`orden`
FROM `grados_niveles`
JOIN `grados` ON `grados`.`id` = `grados_niveles`.`id_grado`
WHERE `grados_niveles`.`activo` = 1
AND `grados_niveles`.`id_nivel` = '2'
ORDER BY `grados`.`orden` ASC
---
    public function getGradosPorEscuela_activos($id_escuela)
    {
        // Instanciar modelo Escuela
        $escuelaModel = new \App\Models\EscuelaModel();
        $escuela = $escuelaModel->find($id_escuela);

        if (!$escuela) {
            return []; // No existe la escuela
        }

        $id_nivel = $escuela['id_nivel'];

        // Hacer join con la tabla 'grados' para obtener nombre y orden
        return $this->select('grados_niveles.*, grados.nombre as nombre_grado, grados.orden')
            ->join('grados', 'grados.id = grados_niveles.id_grado')
            ->where('grados_niveles.activo', 1)
            ->where('grados_niveles.id_nivel', $id_nivel)
            ->orderBy('grados.orden', 'ASC')
            ->findAll();

SELECT *
FROM `escuela`
WHERE `escuela`.`id` = '1'
SELECT COUNT(*) AS `numrows`
FROM `grados_niveles`
WHERE `activo` = 1
AND `id_nivel` = '2'
---
    public function getCantidadGradosActivos($id_escuela)
    {
        $escuelaModel = new \App\Models\EscuelaModel();
        $escuela = $escuelaModel->find($id_escuela);

        if (!$escuela) {
            return 0; // No existe la escuela
        }

        $id_nivel = $escuela['id_nivel'];

        return $this->where('activo', 1)
            ->where('id_nivel', $id_nivel)
            ->countAllResults();