app/Models/InscripcionesModel.php

    public function getEstudiantesInscritosPorResponsable($id_responsable, $id_schoolYear)
    {
        return $this->select('
            estudiantes.id,
            estudiantes.nombre,
            estudiantes.apellido,
            cursos_base.nombre_curso AS curso
        ')
            ->join('estudiantes', 'estudiantes.id = inscripciones.id_estudiante')
            ->join('cursos', 'cursos.id = inscripciones.id_curso') // <---- ahora enlaza directo con cursos
            ->join('cursos_base', 'cursos_base.id = cursos.id_cursos_base', 'left') // <---- para obtener el nombre del curso
            ->join('pagos', 'pagos.id_estudiante = estudiantes.id')
            ->where('pagos.id_responsable', $id_responsable)
            ->where('inscripciones.id_schoolYear', $id_schoolYear)
            ->where('inscripciones.activo', 1)
            ->orderBy('inscripciones.id', 'DESC')
            ->findAll();
---
SELECT `estudiantes`.`id`, `estudiantes`.`nombre`, `estudiantes`.`apellido`, `cursos`.`nombreCurso` AS `curso`
FROM `inscripciones`
JOIN `estudiantes` ON `estudiantes`.`id` = `inscripciones`.`id_estudiante`
JOIN `distribucion_academica` ON `distribucion_academica`.`id` = `inscripciones`.`id_distribucion_academica`
JOIN `cursos` ON `cursos`.`id` = `distribucion_academica`.`id_curso`
JOIN `pagos` ON `pagos`.`id_estudiante` = `estudiantes`.`id`
WHERE `pagos`.`id_responsable` = '1'
AND `inscripciones`.`id_schoolYear` = '1'
AND `inscripciones`.`activo` = 1
GROUP BY `estudiantes`.`id`

    public function contarEstudiantesPorEscuela($idEscuela)
    {
        return $this->select("
            COUNT(inscripciones.id_estudiante) AS total,
            SUM(CASE WHEN estudiantes.sexo = 'M' THEN 1 ELSE 0 END) AS total_masculino,
            SUM(CASE WHEN estudiantes.sexo = 'F' THEN 1 ELSE 0 END) AS total_femenino
        ")
            ->join('estudiantes', 'estudiantes.id = inscripciones.id_estudiante')
            ->join('schoolyear', 'schoolyear.id = inscripciones.id_schoolYear')
            ->where('inscripciones.id_escuela', $idEscuela)
            ->where('inscripciones.activo', 1)
            ->where('schoolyear.estado', 'En curso')
            ->get()
            ->getRowArray();
---
SELECT COUNT(inscripciones.id_estudiante) AS total, SUM(CASE WHEN estudiantes.sexo = 'M' THEN 1 ELSE 0 END) AS total_masculino, SUM(CASE WHEN estudiantes.sexo = 'F' THEN 1 ELSE 0 END) AS total_femenino
FROM `inscripciones`
JOIN `estudiantes` ON `estudiantes`.`id` = `inscripciones`.`id_estudiante`
JOIN `schoolyear` ON `schoolyear`.`id` = `inscripciones`.`id_schoolYear`
WHERE `inscripciones`.`id_escuela` = '2'
AND `inscripciones`.`activo` = 1
AND `schoolyear`.`estado` = 'En curso'

    public function contarFamiliasPorEscuela($idEscuela)
    {
        return $this->db->table('inscripciones i')
            ->join('estudiantes e', 'e.id = i.id_estudiante')
            ->join('estudiantes_responsables er', 'er.estudiante_id = e.id')
            ->join('schoolyear sy', 'sy.id = i.id_schoolYear')
            ->where('i.id_escuela', $idEscuela)
            ->where('i.activo', 1)
            ->where('sy.estado', 'En curso')
            ->select('COUNT(DISTINCT er.responsable_id) AS total_familias')
            ->get()
            ->getRowArray();
---
SELECT COUNT(DISTINCT er.responsable_id) AS total_familias
FROM `inscripciones` `i`
JOIN `estudiantes` `e` ON `e`.`id` = `i`.`id_estudiante`
JOIN `estudiantes_responsables` `er` ON `er`.`estudiante_id` = `e`.`id`
JOIN `schoolyear` `sy` ON `sy`.`id` = `i`.`id_schoolYear`
WHERE `i`.`id_escuela` = '2'
AND `i`.`activo` = 1
AND `sy`.`estado` = 'En curso'