app/Models/PagosModel.php

SELECT `pagos`.*, `concepto_pagos`.`nombre` AS `concepto_pago`, CONCAT(responsables.nombre_padre, " ", responsables.apellido_padre) AS responsable, CONCAT(estudiantes.nombre, " ", estudiantes.apellido) AS estudiante
FROM `pagos`
LEFT JOIN `concepto_pagos` ON `concepto_pagos`.`id` = `pagos`.`id_concepto`
LEFT JOIN `responsables` ON `responsables`.`id` = `pagos`.`id_responsable`
LEFT JOIN `estudiantes` ON `estudiantes`.`id` = `pagos`.`id_estudiante`
ORDER BY `pagos`.`fecha_pago` DESC
---
    public function getPagosConDetalles()
    {
        return $this->select('
                pagos.*,
                concepto_pagos.nombre AS concepto_pago,
                CONCAT(responsables.nombre, " ", responsables.apellido) AS responsable,
                CONCAT(estudiantes.nombre, " ", estudiantes.apellido) AS estudiante
            ')
            ->join('concepto_pagos', 'concepto_pagos.id = pagos.id_concepto', 'left')
            ->join('responsables', 'responsables.id = pagos.id_responsable', 'left')
            ->join('estudiantes', 'estudiantes.id = pagos.id_estudiante', 'left')
            ->orderBy('pagos.fecha_pago', 'DESC')
            ->findAll();

SELECT `mes`
FROM `pagos`
WHERE `id_estudiante` = '3'
AND `id_schoolYear` = '1'
AND `id_concepto` = 3
SELECT *
FROM `concepto_pagos`
WHERE `nombre` = 'Mensualidad'
---
    public function getMesesPendientes($id_estudiante, $id_schoolYear)
{
    // Meses 1 a 12
    $todosLosMeses = range(1, 12);

    // Buscar meses que ya tienen pago registrado en la tabla pagos
    $pagosRealizados = $this->select('mes')
        ->where('id_estudiante', $id_estudiante)
        ->where('id_schoolYear', $id_schoolYear)
        ->where('id_concepto', 3) // Concepto de Mensualidad (ajusta si usas otro id)
        ->findAll();

    // Si no se encuentra el campo mes en la tabla, te tocará agregarlo (ya lo hablamos)
    $mesesPagados = array_column($pagosRealizados, 'mes');

    // Filtrar meses pendientes
    $mesesPendientes = array_diff($todosLosMeses, $mesesPagados);

    $resultado = [];

    // Obtener el monto de la mensualidad
    $conceptoMensualidad = $this->db->table('concepto_pagos')->where('nombre', 'Mensualidad')->get()->getRowArray();