app/Models/PersonalModel.php

SELECT COUNT(*) AS `numrows`
FROM `personal`
LEFT JOIN `nombramiento` AS `n_oficial` ON `n_oficial`.`id` = `personal`.`nombramiento`
LEFT JOIN `nombramiento` AS `n_funcion` ON `n_funcion`.`id` = `personal`.`funcion`
WHERE   (
`n_oficial`.`nombre` = 'Docente'
OR `n_funcion`.`nombre` = 'Docente'
 )
AND `personal`.`id_escuela` = '2'
AND `personal`.`activo` = 1
---
    public function contarDocentesPorEscuela($idEscuela)
    {
        return $this->join('nombramiento AS n_oficial', 'n_oficial.id = personal.nombramiento', 'left')
            ->join('nombramiento AS n_funcion', 'n_funcion.id = personal.funcion', 'left')
            ->groupStart()
            ->where('n_oficial.nombre', 'Docente')
            ->orWhere('n_funcion.nombre', 'Docente')
            ->groupEnd()
            ->where('personal.id_escuela', $idEscuela)
            ->where('personal.activo', 1)
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `personal`
WHERE `personal`.`id_escuela` = '2'
AND `personal`.`activo` = 1
---
    public function contarPersonalPorEscuela($idEscuela)
    {
        return $this->where('personal.id_escuela', $idEscuela)
            ->where('personal.activo', 1)
            ->countAllResults();