app/Models/UsuariosModel.php

SELECT *
FROM `usuarios`
WHERE `usuario` = 'rdmorontag'
AND `activo` = 1
 LIMIT 1
---
    public function verificarCredenciales($usuario)
    {
        return $this->where('usuario', $usuario)
            ->where('activo', 1) // Solo usuarios activos
            ->first();

SELECT `usuarios`.*, `personal`.`nombre` AS `personal_nombre`, `personal`.`apellido` AS `personal_apellido`, `personal`.`email` AS `personal_email`, `personal`.`funcion` AS `personal_funcion_id`, `nombramiento`.`nombre` AS `personal_funcion`, `estudiantes`.`nombre` AS `estudiante_nombre`, `estudiantes`.`apellido` AS `estudiante_apellido`, `estudiantes`.`matricula` AS `estudiante_matricula`, `estudiantes`.`imagen` AS `estudiante_foto`, `tipo_usuario`.`nombre` AS `tipo_usuario`
FROM `usuarios`
LEFT JOIN `personal` ON `personal`.`id` = `usuarios`.`personal_id`
LEFT JOIN `nombramiento` ON `nombramiento`.`id` = `personal`.`funcion`
LEFT JOIN `estudiantes` ON `estudiantes`.`id` = `usuarios`.`estudiantes_id`
LEFT JOIN `tipo_usuario` ON `tipo_usuario`.`id` = `usuarios`.`id_tipo_usuario`
WHERE `usuarios`.`id` = '9'
 LIMIT 1
---
    public function getUsuarioCompleto($usuarioId)
    {
        return $this->select('usuarios.*,
        personal.nombre AS personal_nombre,
        personal.apellido AS personal_apellido,
        personal.email AS personal_email,
        personal.funcion AS personal_funcion_id,
        nombramiento.nombre AS personal_funcion,
        estudiantes.nombre AS estudiante_nombre,
        estudiantes.apellido AS estudiante_apellido,
        estudiantes.matricula AS estudiante_matricula,
        estudiantes.imagen AS estudiante_foto,
        tipo_usuario.nombre AS tipo_usuario')
            ->join('personal', 'personal.id = usuarios.personal_id', 'left')
            ->join('nombramiento', 'nombramiento.id = personal.funcion', 'left')
            ->join('estudiantes', 'estudiantes.id = usuarios.estudiantes_id', 'left')
            ->join('tipo_usuario', 'tipo_usuario.id = usuarios.id_tipo_usuario', 'left')
            ->where('usuarios.id', $usuarioId)
            ->first();